script/k6-scripts/results/20260619-225054/jwt_false_casbin_false_rl_false_pool_false_iam_group_detail.log
 Container RPA-minio Running 
 Container RPA-pgdb Running 
 Container RPA-cadvisor Running 
 Container RPA-redis Running 
 Container rmqnamesrv Running 
 Container RPA-prometheus Running 
 Container rmqbroker Running 
 Container RPA-app Running 
 Container script-k6-run-f53cb573ae98 Creating 
 Container script-k6-run-f53cb573ae98 Created 

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/apis/iam_group_detail.js
        output: Prometheus remote write (http://prometheus:9090/api/v1/write)

     scenarios: (100.00%) 1 scenario, 200 max VUs, 1m30s max duration (incl. graceful stop):
              * single_api: 300.00 iterations/s for 1m0s (maxVUs: 150-200, exec: singleApi, gracefulStop: 30s)


Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

Run          [ 100% ] setup()
single_api   [   0% ]

running (0m48.0s), 001/150 VUs, 97 complete and 0 interrupted iterations
single_api   [   1% ] 001/150 VUs  0m00.3s/1m0s  300.00 iters/s

running (0m49.0s), 001/150 VUs, 397 complete and 0 interrupted iterations
single_api   [   2% ] 001/150 VUs  0m01.3s/1m0s  300.00 iters/s

running (0m50.0s), 001/150 VUs, 697 complete and 0 interrupted iterations
single_api   [   4% ] 001/150 VUs  0m02.3s/1m0s  300.00 iters/s

running (0m51.0s), 000/150 VUs, 997 complete and 0 interrupted iterations
single_api   [   6% ] 000/150 VUs  0m03.3s/1m0s  300.00 iters/s

running (0m52.0s), 001/150 VUs, 1297 complete and 0 interrupted iterations
single_api   [   7% ] 001/150 VUs  0m04.3s/1m0s  300.00 iters/s

running (0m53.0s), 000/150 VUs, 1597 complete and 0 interrupted iterations
single_api   [   9% ] 000/150 VUs  0m05.3s/1m0s  300.00 iters/s

running (0m54.0s), 001/150 VUs, 1897 complete and 0 interrupted iterations
single_api   [  11% ] 001/150 VUs  0m06.3s/1m0s  300.00 iters/s

running (0m55.0s), 000/150 VUs, 2197 complete and 0 interrupted iterations
single_api   [  12% ] 000/150 VUs  0m07.3s/1m0s  300.00 iters/s

running (0m56.0s), 000/150 VUs, 2497 complete and 0 interrupted iterations
single_api   [  14% ] 000/150 VUs  0m08.3s/1m0s  300.00 iters/s

running (0m57.0s), 000/150 VUs, 2797 complete and 0 interrupted iterations
single_api   [  16% ] 000/150 VUs  0m09.3s/1m0s  300.00 iters/s

running (0m58.0s), 001/150 VUs, 3097 complete and 0 interrupted iterations
single_api   [  17% ] 001/150 VUs  0m10.3s/1m0s  300.00 iters/s

running (0m59.0s), 001/150 VUs, 3397 complete and 0 interrupted iterations
single_api   [  19% ] 001/150 VUs  0m11.3s/1m0s  300.00 iters/s

running (1m00.0s), 000/150 VUs, 3697 complete and 0 interrupted iterations
single_api   [  21% ] 000/150 VUs  0m12.3s/1m0s  300.00 iters/s

running (1m01.0s), 000/150 VUs, 3997 complete and 0 interrupted iterations
single_api   [  22% ] 000/150 VUs  0m13.3s/1m0s  300.00 iters/s

running (1m02.0s), 000/150 VUs, 4297 complete and 0 interrupted iterations
single_api   [  24% ] 000/150 VUs  0m14.3s/1m0s  300.00 iters/s

running (1m03.0s), 001/150 VUs, 4597 complete and 0 interrupted iterations
single_api   [  26% ] 001/150 VUs  0m15.3s/1m0s  300.00 iters/s

running (1m04.0s), 000/150 VUs, 4897 complete and 0 interrupted iterations
single_api   [  27% ] 000/150 VUs  0m16.3s/1m0s  300.00 iters/s

running (1m05.0s), 001/150 VUs, 5197 complete and 0 interrupted iterations
single_api   [  29% ] 001/150 VUs  0m17.3s/1m0s  300.00 iters/s

running (1m06.0s), 001/150 VUs, 5497 complete and 0 interrupted iterations
single_api   [  31% ] 001/150 VUs  0m18.3s/1m0s  300.00 iters/s

running (1m07.0s), 000/150 VUs, 5797 complete and 0 interrupted iterations
single_api   [  32% ] 000/150 VUs  0m19.3s/1m0s  300.00 iters/s

running (1m08.0s), 000/150 VUs, 6097 complete and 0 interrupted iterations
single_api   [  34% ] 000/150 VUs  0m20.3s/1m0s  300.00 iters/s

running (1m09.0s), 001/150 VUs, 6397 complete and 0 interrupted iterations
single_api   [  36% ] 001/150 VUs  0m21.3s/1m0s  300.00 iters/s

running (1m10.0s), 001/150 VUs, 6697 complete and 0 interrupted iterations
single_api   [  37% ] 001/150 VUs  0m22.3s/1m0s  300.00 iters/s

running (1m11.0s), 001/150 VUs, 6997 complete and 0 interrupted iterations
single_api   [  39% ] 001/150 VUs  0m23.3s/1m0s  300.00 iters/s

running (1m12.0s), 001/150 VUs, 7297 complete and 0 interrupted iterations
single_api   [  41% ] 001/150 VUs  0m24.3s/1m0s  300.00 iters/s

running (1m13.0s), 001/150 VUs, 7597 complete and 0 interrupted iterations
single_api   [  42% ] 001/150 VUs  0m25.3s/1m0s  300.00 iters/s

running (1m14.0s), 001/150 VUs, 7897 complete and 0 interrupted iterations
single_api   [  44% ] 001/150 VUs  0m26.3s/1m0s  300.00 iters/s

running (1m15.0s), 000/150 VUs, 8197 complete and 0 interrupted iterations
single_api   [  46% ] 000/150 VUs  0m27.3s/1m0s  300.00 iters/s

running (1m16.0s), 000/150 VUs, 8497 complete and 0 interrupted iterations
single_api   [  47% ] 000/150 VUs  0m28.3s/1m0s  300.00 iters/s

running (1m17.0s), 001/150 VUs, 8797 complete and 0 interrupted iterations
single_api   [  49% ] 001/150 VUs  0m29.3s/1m0s  300.00 iters/s

running (1m18.0s), 000/150 VUs, 9097 complete and 0 interrupted iterations
single_api   [  51% ] 001/150 VUs  0m30.3s/1m0s  300.00 iters/s

running (1m19.0s), 000/150 VUs, 9397 complete and 0 interrupted iterations
single_api   [  52% ] 000/150 VUs  0m31.3s/1m0s  300.00 iters/s

running (1m20.0s), 001/150 VUs, 9697 complete and 0 interrupted iterations
single_api   [  54% ] 001/150 VUs  0m32.3s/1m0s  300.00 iters/s

running (1m21.0s), 001/150 VUs, 9997 complete and 0 interrupted iterations
single_api   [  56% ] 001/150 VUs  0m33.3s/1m0s  300.00 iters/s

running (1m22.0s), 001/150 VUs, 10297 complete and 0 interrupted iterations
single_api   [  57% ] 001/150 VUs  0m34.3s/1m0s  300.00 iters/s

running (1m23.0s), 000/150 VUs, 10597 complete and 0 interrupted iterations
single_api   [  59% ] 000/150 VUs  0m35.3s/1m0s  300.00 iters/s

running (1m24.0s), 000/150 VUs, 10897 complete and 0 interrupted iterations
single_api   [  61% ] 000/150 VUs  0m36.3s/1m0s  300.00 iters/s

running (1m25.0s), 000/150 VUs, 11197 complete and 0 interrupted iterations
single_api   [  62% ] 000/150 VUs  0m37.3s/1m0s  300.00 iters/s

running (1m26.0s), 001/150 VUs, 11497 complete and 0 interrupted iterations
single_api   [  64% ] 001/150 VUs  0m38.3s/1m0s  300.00 iters/s

running (1m27.0s), 001/150 VUs, 11797 complete and 0 interrupted iterations
single_api   [  66% ] 001/150 VUs  0m39.3s/1m0s  300.00 iters/s

running (1m28.0s), 001/150 VUs, 12097 complete and 0 interrupted iterations
single_api   [  67% ] 001/150 VUs  0m40.3s/1m0s  300.00 iters/s

running (1m29.0s), 001/150 VUs, 12397 complete and 0 interrupted iterations
single_api   [  69% ] 001/150 VUs  0m41.3s/1m0s  300.00 iters/s

running (1m30.0s), 001/150 VUs, 12697 complete and 0 interrupted iterations
single_api   [  71% ] 001/150 VUs  0m42.3s/1m0s  300.00 iters/s

running (1m31.0s), 000/150 VUs, 12997 complete and 0 interrupted iterations
single_api   [  72% ] 000/150 VUs  0m43.3s/1m0s  300.00 iters/s

running (1m32.0s), 001/150 VUs, 13297 complete and 0 interrupted iterations
single_api   [  74% ] 001/150 VUs  0m44.3s/1m0s  300.00 iters/s

running (1m33.0s), 000/150 VUs, 13597 complete and 0 interrupted iterations
single_api   [  76% ] 000/150 VUs  0m45.3s/1m0s  300.00 iters/s

running (1m34.0s), 000/150 VUs, 13897 complete and 0 interrupted iterations
single_api   [  77% ] 000/150 VUs  0m46.3s/1m0s  300.00 iters/s

running (1m35.0s), 001/150 VUs, 14197 complete and 0 interrupted iterations
single_api   [  79% ] 001/150 VUs  0m47.3s/1m0s  300.00 iters/s

running (1m36.0s), 000/150 VUs, 14497 complete and 0 interrupted iterations
single_api   [  81% ] 000/150 VUs  0m48.3s/1m0s  300.00 iters/s

running (1m37.0s), 000/150 VUs, 14797 complete and 0 interrupted iterations
single_api   [  82% ] 001/150 VUs  0m49.3s/1m0s  300.00 iters/s

running (1m38.0s), 001/150 VUs, 15097 complete and 0 interrupted iterations
single_api   [  84% ] 001/150 VUs  0m50.3s/1m0s  300.00 iters/s

running (1m39.0s), 000/150 VUs, 15397 complete and 0 interrupted iterations
single_api   [  86% ] 000/150 VUs  0m51.3s/1m0s  300.00 iters/s

running (1m40.0s), 000/150 VUs, 15697 complete and 0 interrupted iterations
single_api   [  87% ] 000/150 VUs  0m52.3s/1m0s  300.00 iters/s

running (1m41.0s), 001/150 VUs, 15997 complete and 0 interrupted iterations
single_api   [  89% ] 001/150 VUs  0m53.3s/1m0s  300.00 iters/s

running (1m42.0s), 000/150 VUs, 16297 complete and 0 interrupted iterations
single_api   [  91% ] 000/150 VUs  0m54.3s/1m0s  300.00 iters/s

running (1m43.0s), 000/150 VUs, 16597 complete and 0 interrupted iterations
single_api   [  92% ] 000/150 VUs  0m55.3s/1m0s  300.00 iters/s

running (1m44.0s), 001/150 VUs, 16897 complete and 0 interrupted iterations
single_api   [  94% ] 001/150 VUs  0m56.3s/1m0s  300.00 iters/s

running (1m45.0s), 000/150 VUs, 17197 complete and 0 interrupted iterations
single_api   [  96% ] 000/150 VUs  0m57.3s/1m0s  300.00 iters/s

running (1m46.0s), 000/150 VUs, 17497 complete and 0 interrupted iterations
single_api   [  97% ] 000/150 VUs  0m58.3s/1m0s  300.00 iters/s

running (1m47.0s), 001/150 VUs, 17797 complete and 0 interrupted iterations
single_api   [  99% ] 001/150 VUs  0m59.3s/1m0s  300.00 iters/s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.95' rate=100.00%

    http_req_duration
    ✓ 'p(95)<1500' p(95)=1.28ms

    http_req_failed
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 18002   167.212511/s
    checks_succeeded...: 100.00% 18002 out of 18002
    checks_failed......: 0.00%   0 out of 18002

    ✓ iam_group_create_seed status
    ✓ iam_group_detail status

    HTTP
    http_req_duration..............: avg=3.58ms min=280.41µs med=948.15µs max=47.65s  p(90)=1.18ms p(95)=1.28ms
      { expected_response:true }...: avg=3.58ms min=280.41µs med=948.15µs max=47.65s  p(90)=1.18ms p(95)=1.28ms
    http_req_failed................: 0.00%  0 out of 18002
    http_reqs......................: 18002  167.212511/s

    EXECUTION
    iteration_duration.............: avg=1.1ms  min=389.93µs med=1.11ms   max=66.32ms p(90)=1.38ms p(95)=1.5ms 
    iterations.....................: 18001  167.203222/s
    vus............................: 1      min=0          max=1  
    vus_max........................: 150    min=150        max=150

    NETWORK
    data_received..................: 12 MB  111 kB/s
    data_sent......................: 3.2 MB 30 kB/s



running (1m47.7s), 000/150 VUs, 18001 complete and 0 interrupted iterations
single_api ✓ [ 100% ] 000/150 VUs  1m0s  300.00 iters/s